// chrome devtools


// https://youtu.be/P753B81-szE

// - выбор элемента
// доступ к колекции выбранных элементов осущ через $, доступны последние пять выделенных дом узлов
$0       // последний выбранный элемент, $1 - предпосл

// - анимации
// панель animations (3 dots > more tools > animations)

// доступно изменение изингов про клику на иконку в стилях элемента


// - networks / работа с сетью

// работа с фильтром
larger-than:1k         // фильтрует все запросы более 1кб
domain:addr.com        // фильтр по домену
has-response-header:_  // фильтр по определённому хедеру

// доступна эмуляция скорости сети
// есть возможость сохранить все логи запросов через контекстное меню (save as HAR with content)
// возможно блокировать загрузку опред ресурсов


